# ElectricalLighting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..ElectricalLighting Property
GroupTypeId Class See Also
---
Electrical - Lighting.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId ElectricalLighting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalLighting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElectricalLighting {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace